Revit 2026 API

# FaceDetailNode Class

---

A base class of output nodes that represent face edges and face silhouettes.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBFaceDetailNode Autodesk.Revit.DBFaceEdgeNode Autodesk.Revit.DBFaceSilhouetteNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceDetailNode : RenderNode
```
```vb
Public Class FaceDetailNode
	Inherits RenderNode
```
```cpp
public ref class FaceDetailNode : public RenderNode
```
```fsharp
type FaceDetailNode =
    class
        inherit RenderNode
    end
```

The FaceDetailNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn. |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceTransform | Returns instance transform of the object being drawn. |
|  | GetLinkTransform | Returns link transform of the object being drawn. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace